app/controllers/candidates_controller.rb

    def set_candidate
      @candidate = Candidate.find(params[:id])
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]