app/controllers/candidates_controller.rb

  def index
    # TODO: Move business logic to model
    # TODO: know about all the callbacks
    unless params[:sort].nil?
      @candidates = Candidate.sort(params[:sort], params[:type])
    else
      @candidates = Candidate.all
---
SELECT "candidates".* FROM "candidates" ORDER BY registration_number DESC

  def create
    @candidate = Candidate.new(candidate_params)

    respond_to do |format|
      if @candidate.save
---
INSERT INTO "candidates" ("date_of_registration", "address", "age", "branch", "contact_number", "email", "experience", "gender", "name", "qualification", "remarks", "specialization", "source_of_registration", "state", "status", "zone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"

  def update
    respond_to do |format|
      if @candidate.update(candidate_params)
        @candidate.update(registration_number: "NZ/" + @candidate.source_of_registration + "/" + @candidate.id.to_s)
---
UPDATE "candidates" SET "address" = $1, "age" = $2, "branch" = $3, "email" = $4, "name" = $5, "qualification" = $6, "remarks" = $7, "specialization" = $8, "status" = $9, "zone" = $10, "date_of_closure" = $11, "updated_at" = $12 WHERE "candidates"."id" = $13
UPDATE "candidates" SET "status" = $1, "updated_at" = $2 WHERE "candidates"."id" = $3  [["status", "Joined"], ["updated_at", "2019-07-10 07:28:03.162410"], ["id", 6]]

  def destroy
    @candidate.destroy
---
DELETE FROM "candidates" WHERE "candidates"."id" = $1  [["id", 10]]

    def set_candidate
      @candidate = Candidate.find(params[:id])
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]